Revit 2027 API
ParameterTypeId.StairsDesiredNumRisers Property
 "Desired Number of Risers"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsDesiredNumRisers { get; }
Public Shared ReadOnly Property StairsDesiredNumRisers As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsDesiredNumRisers {
	ForgeTypeId^ get ();
}
static member StairsDesiredNumRisers : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace